/*
 * To change this license header, choose License Headers in Project Properties.
 * To change this template file, choose Tools | Templates
 * and open the template in the editor.
 */
package shkurenko3;

/**
 *
 * @author Mebius
 */
public class Shkurenko3 {

    /**
     * @param args the command line arguments
     */
    public static void main(String[] args) {
        /*1.	Ввести с клавиатуры два 3-значных числа и поменять у них средние цифры 
        (например, ввести 357  и 702 – получить и вывести числа  307 и 752).
        */
        //2.	Ввести 4-значное число и подсчитать сумму первой и третьей цифры и разность второй и четвертой цифры.
        
        /*3.	Ввести с клавиатуры 3-значное число и удалить из него среднюю цифру 
        (например, ввести 3, 5, 7 – получить и вывести число 37).
        */
        /*4.	Написать программу, которая предлагает пользователю ввести сумму 
        денежного вклада в гривнах, а также процент годовых, которые выплачивает банк. 
                Определить сумму денег, выплачиваемых банком вкладчику каждый месяц.
        */
        //5.	Сколько товара ценой Y можно купить на Х гривен и сколько получить сдачи?
        
        /*6.	Написать программу, которая переводит фунты в килограммы. 
        Один фунт – 405.9 грамма задается в программе как константа. 
        Затем, реализовать обратный перевод – из килограммов в фунты.
        */
        /*7.	Ввести длину, ширину и высоту комнаты. 
        Подсчитать, сколько краски уйдет на покраску стен этой комнаты, 
                если на 1м2 стены приходится N литров краски и M% поверхности стен занимают окна и двери. 
                Также, рассчитать общую стоимость краски, с учётом того, что один литр краски стоит R гривен. 
        */
        //8.	Ввести с клавиатуры 3-значное число и «перевернуть» его (например, ввести 357 – получить и вывести 753).
        
        /*9.	Ввести пятизначное число и сдвинуть его циклически вправо на 2 разряда 
        (например, если число равно 12345 – вывести на экран 45123).
        */
        /*10.	Рассчитать общую массу всех планет Солнечной системы. 
        Вычислить среднее арифметическое масс планет. 
                Затем - массу каждой планеты в процентном соотношении, 
                если принять за 100% общую массу всех планет. 
                Во сколько раз масса самой крупной планеты больше чем сумма масс 
                        всех остальных планет? Все результаты – показать на экране. 
                                Рекомендуется использование типа BigDecimal.
        */

    }
    
}
